In [2]:
import pandas as pd
pd.set_option('max_rows', 5)
#from learntools.advanced_pandas.creating_reading_writing import *

In [6]:
#Create a DataFrame
pd.DataFrame({'Apples': [30], 'Bananas': [50]})

   Apples  Bananas
0      30       50

In [12]:
#Create a DataFrame with an index
pd.DataFrame({'Apples': [30, 34], 'Oranges': [20, 22]}, index= ['fruit 1', 'fruit 2'])

         Apples  Oranges
fruit 1      30       20
fruit 2      34       22

In [17]:
#Create a Series with a name
pd.Series(['Yellow', 'Blue', 'Green', 'Orange'], index=['var1', 'var2', 'var3', 'var4'], name='colors')

var1    Yellow
var2      Blue
var3     Green
var4    Orange
Name: colors, dtype: object

In [ ]:
x4 = pd.read_csv("../input/wine-reviews/winemag-data_first150k.csv")
#wine_reviews = pd.read_csv("../input/wine-reviews/winemag-data-130k-v2.csv")
check_q4(x4)

In [ ]:
#x5 = pd.read_excel("../input/publicassistance/xls_files_all/WICAgencies2014ytd.xls", sheet_name='Pregnant women participating')
#x5.head()
wic = pd.read_excel("../input/publicassistance/xls_files_all/WICAgencies2014ytd.xls", sheet_name='Pregnant Women Participating')
wic.head()

#### Groupby

In [1]:
# import the pandas library
import pandas as pd

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

In [2]:
df.groupby('Team').groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [3]:
df.groupby(['Team', 'Year']).groups

{('Devils', 2014): Int64Index([2], dtype='int64'),
 ('Devils', 2015): Int64Index([3], dtype='int64'),
 ('Kings', 2014): Int64Index([4], dtype='int64'),
 ('Kings', 2016): Int64Index([6], dtype='int64'),
 ('Kings', 2017): Int64Index([7], dtype='int64'),
 ('Riders', 2014): Int64Index([0], dtype='int64'),
 ('Riders', 2015): Int64Index([1], dtype='int64'),
 ('Riders', 2016): Int64Index([8], dtype='int64'),
 ('Riders', 2017): Int64Index([11], dtype='int64'),
 ('Royals', 2014): Int64Index([9], dtype='int64'),
 ('Royals', 2015): Int64Index([10], dtype='int64'),
 ('kings', 2015): Int64Index([5], dtype='int64')}

In [4]:
grouped = df.groupby('Year')
print(grouped.groups)
print('------------------------------')
for name, group in grouped:
    print(name)
    print(group)

{2014: Int64Index([0, 2, 4, 9], dtype='int64'), 2015: Int64Index([1, 3, 5, 10], dtype='int64'), 2016: Int64Index([6, 8], dtype='int64'), 2017: Int64Index([7, 11], dtype='int64')}
------------------------------
2014
   Points  Rank    Team  Year
0     876     1  Riders  2014
2     863     2  Devils  2014
4     741     3   Kings  2014
9     701     4  Royals  2014
2015
    Points  Rank    Team  Year
1      789     2  Riders  2015
3      673     3  Devils  2015
5      812     4   kings  2015
10     804     1  Royals  2015
2016
   Points  Rank    Team  Year
6     756     1   Kings  2016
8     694     2  Riders  2016
2017
    Points  Rank    Team  Year
7      788     1   Kings  2017
11     690     2  Riders  2017

In [5]:
print(grouped.get_group(2014))

   Points  Rank    Team  Year
0     876     1  Riders  2014
2     863     2  Devils  2014
4     741     3   Kings  2014
9     701     4  Royals  2014

In [12]:
import numpy as np
grouped['Points'].agg(np.mean)

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [20]:
grouped2 = df.groupby('Team')
grouped2.agg(np.size)

        Points  Rank  Year
Team
Devils       2     2     2
Kings        3     3     3
Riders       4     4     4
Royals       2     2     2
kings        1     1     1

In [23]:
grouped2['Points'].agg([np.mean, np.sum, np.std])

              mean   sum         std
Team
Devils  768.000000  1536  134.350288
Kings   761.666667  2285   24.006943
Riders  762.250000  3049   88.567771
Royals  752.500000  1505   72.831998
kings   812.000000   812         NaN

In [24]:
grouped3 = df.groupby('Team')

In [31]:
grouped3.filter(lambda x: len(x) >= 4)

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
8      694     2  Riders  2016
11     690     2  Riders  2017